; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v1 ?v10)
             (pred_10 ?v12 ?v3)
             (pred_4 ?v1 ?v3)
             (pred_2 ?v9 ?v1 )
	     (pred_12 ?v1)
             (pred_8 ?v6)
             (pred_1 ?v12)
             (pred_5 ?v3)
             (pred_3 ?v1)
             (pred_6 ?v12)
             (pred_7 ?v1)
             (pred_9 ))



(:action op_1
:parameters (?v2 ?v8 ?v11 ?v13)
:precondition (and (pred_8 ?v2) (pred_8 ?v8) (pred_1 ?v11) (pred_5 ?v13)
          (pred_11 ?v2 ?v8) (pred_10 ?v11 ?v13)
                   (pred_4 ?v8 ?v13) (pred_12 ?v2) 
                   (pred_3 ?v8) (pred_6 ?v11))
:effect (and  (pred_7 ?v8) (not (pred_3 ?v8))))


(:action op_4
:parameters (?v2 ?v7)
:precondition (and (pred_8 ?v2) (pred_8 ?v7)
               (pred_12 ?v2) (pred_11 ?v2 ?v7) (pred_7 ?v7))
:effect (and (pred_12 ?v7) (not (pred_12 ?v2))))

(:action op_3
:parameters (?v2 ?v11)
:precondition (and (pred_8 ?v2) (pred_1 ?v11) 
                  (pred_12 ?v2) (pred_2 ?v11 ?v2) (pred_9 ))
:effect (and (pred_6 ?v11)
   (not (pred_2 ?v11 ?v2)) (not (pred_9 ))))


(:action op_2
:parameters (?v2 ?v5 ?v4)
:precondition (and (pred_8 ?v2) (pred_1 ?v5) (pred_1 ?v4)
                  (pred_12 ?v2) (pred_6 ?v4) (pred_2 ?v5 ?v2))
:effect (and (pred_6 ?v5) (pred_2 ?v4 ?v2)
        (not (pred_6 ?v4)) (not (pred_2 ?v5 ?v2))))

(:action op_5
:parameters (?v2 ?v11)
:precondition (and (pred_8 ?v2) (pred_1 ?v11) 
                  (pred_12 ?v2) (pred_6 ?v11))
:effect (and (pred_9 ) (pred_2 ?v11 ?v2) (not (pred_6 ?v11)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_04 obj_09 obj_05 obj_08 obj_01 obj_11 obj_06 obj_10 obj_03
    obj_12 obj_13
    obj_02 obj_07
    )

    (:init
       (pred_9)

       (pred_8 obj_04)
       (pred_8 obj_09)
       (pred_8 obj_05)
       (pred_8 obj_08)
       (pred_8 obj_01)
       (pred_8 obj_11)
       (pred_8 obj_06)
       (pred_8 obj_10)
       (pred_8 obj_03)
       (pred_5 obj_12)
       (pred_5 obj_13)
       (pred_1 obj_02)
       (pred_1 obj_07)

       (pred_11 obj_04 obj_08)
       (pred_11 obj_04 obj_09)
       (pred_11 obj_09 obj_01)
       (pred_11 obj_09 obj_05)
       (pred_11 obj_09 obj_04)
       (pred_11 obj_05 obj_11)
       (pred_11 obj_05 obj_09)
       (pred_11 obj_08 obj_06)
       (pred_11 obj_08 obj_01)
       (pred_11 obj_08 obj_04)
       (pred_11 obj_01 obj_10)
       (pred_11 obj_01 obj_11)
       (pred_11 obj_01 obj_09)
       (pred_11 obj_01 obj_08)
       (pred_11 obj_11 obj_03)
       (pred_11 obj_11 obj_05)
       (pred_11 obj_11 obj_01)
       (pred_11 obj_06 obj_10)
       (pred_11 obj_06 obj_08)
       (pred_11 obj_10 obj_03)
       (pred_11 obj_10 obj_01)
       (pred_11 obj_10 obj_06)
       (pred_11 obj_03 obj_11)
       (pred_11 obj_03 obj_10)
       (pred_3 obj_09)
       (pred_3 obj_11)
       (pred_4  obj_09 obj_12)
       (pred_4  obj_11 obj_13)
       (pred_7 obj_04)
       (pred_7 obj_05)
       (pred_7 obj_08)
       (pred_7 obj_01)
       (pred_7 obj_06)
       (pred_7 obj_10)
       (pred_7 obj_03)

       (pred_10  obj_02 obj_12)
       (pred_10  obj_07 obj_13)
       (pred_2 obj_02 obj_06)
       (pred_2 obj_07 obj_04)
       (pred_12 obj_06)
    )

    (:goal (and
       (pred_2 obj_02 obj_09)
    ))
(:constraints
  (always (not (pred_12 obj_08)))
)
)

; plan
1. (op_3 obj_06 obj_02)
   deleted: (pred_2 obj_02 obj_06) (pred_9)
   added: (pred_6 obj_02)
   goals met: 0 of 1
2. (op_4 obj_06 obj_10)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_10)
   goals met: 0 of 1
3. (op_4 obj_10 obj_01)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_01)
   goals met: 0 of 1
4. (op_1 obj_01 obj_09 obj_02 obj_12)
   deleted: (pred_3 obj_09)
   added: (pred_7 obj_09)
   goals met: 0 of 1
5. (op_4 obj_01 obj_09)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_09)
   goals met: 0 of 1
6. (op_5 obj_09 obj_02)
   deleted: (pred_6 obj_02)
   added: (pred_9) (pred_2 obj_02 obj_09)
   goals met: 1 of 1
